import SubHeader from "../SubHeader/SubHeader";
import SubPageProducts from "../SubPageProducts";


// getIdx : 헤더에서 클릭한 카테고리의 Idx값 가져오기(각 카테고리별로 처음부터 0)
// navEvt : subHeader의 카테고리 메뉴 클릭 시 페이지 전환 이벤트 함수(subHeader로 전달하기 위함)
function SubPageDressroom({ getIdx, navEvt }) {
    // 하위 subHeader로 던져줄 데이터
    const categoryChild = ["행거", "수납장", "화장대"],
        bgImg = {
            background: "url(./images/sub/Dressroom/DressroomTitle.png) center/cover"
        };

    const outData = [
        // 행거 데이터
        {
            Best: [
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20]
            ],
            Product1: [
                ["", "행거", 200000, 250000, 20],
                ["", "행거", 200000, 250000, 20],
                ["", "행거", 200000, 250000, 20],
                ["", "행거", 200000, 250000, 20]
            ],
            Product2: [
                ["", "행거", 200000, 250000, 20],
                ["", "행거", 200000, 250000, 20],
                ["", "행거", 200000, 250000, 20],
                ["", "행거", 200000, 250000, 20]
            ]
        },
        // 수납장 데이터
        {
            Best: [
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20]
            ],
            Product1: [
                ["", "수납장", 200000, 250000, 20],
                ["", "수납장", 200000, 250000, 20],
                ["", "수납장", 200000, 250000, 20],
                ["", "수납장", 200000, 250000, 20]
            ],
            Product2: [
                ["", "수납장", 200000, 250000, 20],
                ["", "수납장", 200000, 250000, 20],
                ["", "수납장", 200000, 250000, 20],
                ["", "수납장", 200000, 250000, 20]
            ]
        },
        // 화장대 데이터
        {
            Best: [
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20],
                ["", "베스트 상품", 200000, 250000, 20]
            ],
            Product1: [
                ["", "화장대", 200000, 250000, 20],
                ["", "화장대", 200000, 250000, 20],
                ["", "화장대", 200000, 250000, 20],
                ["", "화장대", 200000, 250000, 20]
            ],
            Product2: [
                ["", "화장대", 200000, 250000, 20],
                ["", "화장대", 200000, 250000, 20],
                ["", "화장대", 200000, 250000, 20],
                ["", "화장대", 200000, 250000, 20]
            ]
        }
    ];


    return (
        <>
            <SubHeader nowPosition="드레스룸" categoryChild={categoryChild}
                bgImg={bgImg} categoryIdx={getIdx} clickEvt={navEvt} />

            <SubPageProducts getData={outData[getIdx]} />
        </>
    )
}

SubPageDressroom.defaultProps = {
    getIdx: 0
}

export default SubPageDressroom;